# Pandas

In [1]:
import pandas as pd

# 1. Data Type

In [2]:
# Data Type 1 : Series
pd.Series()
animals_series = pd.Series(["dog", "cat", "iguana"])
animals_series[2:]
list(animals_series)

['dog', 'cat', 'iguana']

In [3]:
# Data Type 2 : DataFrame

# make DataFrame as columns name
df = pd.DataFrame(columns=["Email","Name"])

# make DataFrame as dictionary list
name = ["Seongyun","zzsza"]
email = ["abc@naver.com","abc@gmail.com"]
df = pd.DataFrame({"Name":name,"Email":email})
df

           Email      Name
0  abc@naver.com  Seongyun
1  abc@gmail.com     zzsza

In [4]:
# row of data frame is series
type(df.loc[1])

pandas.core.series.Series

In [5]:
# get column from DataFrame
print(df["Name"])
print(df.Name)

0    Seongyun
1       zzsza
Name: Name, dtype: object
0    Seongyun
1       zzsza
Name: Name, dtype: object

In [6]:
# get row from Data Frame
df.loc[1]

Email    abc@gmail.com
Name             zzsza
Name: 1, dtype: object

# 2. Insert

In [7]:
# insert dictionary data
df.loc[2] = {"Name":"seongjin byeon", "Email":"bsj@gmail.com"}
df

           Email            Name
0  abc@naver.com        Seongyun
1  abc@gmail.com           zzsza
2  bsj@gmail.com  seongjin byeon

In [8]:
# add Column
df["Address"] = ""

# remove Column
# inplace=True : adapt DataFrame directly
# axis=1 : append width (default : axis=0)
df.drop('Address', axis=1, inplace=True) 

# insert new Column Data (using functional programing)

# first method
def get_address(name):
    return "Mapo Cobion (" + name + ")"
df["Address"] = df["Name"].apply(get_address)

# second method (using lambda)
df["Address"] = df["Name"].apply(lambda name: "Incheonsi (" + name + ")")

In [9]:
df

           Email            Name                     Address
0  abc@naver.com        Seongyun        Incheonsi (Seongyun)
1  abc@gmail.com           zzsza           Incheonsi (zzsza)
2  bsj@gmail.com  seongjin byeon  Incheonsi (seongjin byeon)

In [10]:
# add just one data
# df.loc[idx,colum] = value
df.loc[2, "Name"] = "bsj"

df

           Email      Name                     Address
0  abc@naver.com  Seongyun        Incheonsi (Seongyun)
1  abc@gmail.com     zzsza           Incheonsi (zzsza)
2  bsj@gmail.com       bsj  Incheonsi (seongjin byeon)

# 3. Append

In [12]:
# make sample data
a_df = pd.DataFrame([
        {
            "Name" : "A 회사 직원 (1)",
            "Age" : 30,
        },
        {
            "Name" : "A 회사 직원 (2)",
            "Age" : 28,
        }
    ])

b_df = pd.DataFrame([
        {
            "Name" : "B 회사 직원 (1)",
            "Age" : 32,
        },
        {
            "Name" : "B 회사 직원 (2)",
            "Age" : 26,
        }
    ])

print(a_df)
print(b_df)

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
   Age         Name
0   32  B 회사 직원 (1)
1   26  B 회사 직원 (2)

In [13]:
# append
ab_df = a_df.append(b_df)
ab_df

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
0   32  B 회사 직원 (1)
1   26  B 회사 직원 (2)

In [14]:
# reindex
ab_df.reset_index(drop=True, inplace=True)
ab_df

   Age         Name
0   30  A 회사 직원 (1)
1   28  A 회사 직원 (2)
2   32  B 회사 직원 (1)
3   26  B 회사 직원 (2)

# 4. Concat

In [15]:
# make sample data
k_df = pd.DataFrame([
        {
            "Name" : "Kakao 회사 직원 (1)",
            "Age" : 30,
        },
        {
            "Name" : "Kakao 회사 직원 (2)",
            "Age" : 28,
        }
    ])

d_df = pd.DataFrame([
        {
            "Name" : "Daum 회사 직원 (1)",
            "Age" : 32,
        },
        {
            "Name" : "Daum 회사 직원 (2)",
            "Age" : 26,
        }
    ])

k_df["Company"] = "Kakao"
d_df["Company"] = "Daum"

print(k_df)
print(d_df)

   Age             Name Company
0   30  Kakao 회사 직원 (1)   Kakao
1   28  Kakao 회사 직원 (2)   Kakao
   Age            Name Company
0   32  Daum 회사 직원 (1)    Daum
1   26  Daum 회사 직원 (2)    Daum

In [16]:
# concat (k_df & d_df)
kd_df = pd.concat([k_df, d_df]).reset_index(drop=True)
kd_df

   Age             Name Company
0   30  Kakao 회사 직원 (1)   Kakao
1   28  Kakao 회사 직원 (2)   Kakao
2   32   Daum 회사 직원 (1)    Daum
3   26   Daum 회사 직원 (2)    Daum

In [17]:
# concat with keys
ab_df = pd.concat([a_df, b_df], keys=["Kakao", "Daum"])
ab_df

         Age         Name
Kakao 0   30  A 회사 직원 (1)
      1   28  A 회사 직원 (2)
Daum  0   32  B 회사 직원 (1)
      1   26  B 회사 직원 (2)

In [18]:
# select Kakao second employer's name
ab_df.loc["Kakao"].loc[1]["Name"]

'A 회사 직원 (2)'

In [20]:
# concat columns
name_age_df = pd.DataFrame([
        {
            "Name":"seongyun",
            "Email":"bsy@gmail.com",
        },
        {
            "Name":"zzsza",
            "Email":"zzsza@naver..com",
        },
    ])

address = pd.DataFrame([
        {
            "Address":"Seoul",
        },
        {
            "Address":"Incheon",
        },
    ])

print(name_age_df)
print(address)

# axis=1 width concat, axis=0 height concat
pd.concat([name_age_df, address], axis=1)

              Email      Name
0     bsy@gmail.com  seongyun
1  zzsza@naver..com     zzsza
   Address
0    Seoul
1  Incheon

              Email      Name  Address
0     bsy@gmail.com  seongyun    Seoul
1  zzsza@naver..com     zzsza  Incheon

# 5. Iterrows (for)

In [21]:
for idx, row in ab_df.iterrows():
    print(idx)
    print("-" * 30)
    print(row)
    print("=" * 30)

('Kakao', 0)
------------------------------
Age              30
Name    A 회사 직원 (1)
Name: (Kakao, 0), dtype: object
==============================
('Kakao', 1)
------------------------------
Age              28
Name    A 회사 직원 (2)
Name: (Kakao, 1), dtype: object
==============================
('Daum', 0)
------------------------------
Age              32
Name    B 회사 직원 (1)
Name: (Daum, 0), dtype: object
==============================
('Daum', 1)
------------------------------
Age              26
Name    B 회사 직원 (2)
Name: (Daum, 1), dtype: object
==============================

# 6. Groupby

In [22]:
# make sample data
df = pd.DataFrame(columns=["si","dong"])
df.loc[len(df)] = ["seoul","sinsa"]
df.loc[len(df)] = ["seoul","mangwon"]
df.loc[len(df)] = ["busan","1dong"]
df.loc[len(df)] = ["busan","2dong"]
df.loc[len(df)] = ["kyungki","suwon"]
df.loc[len(df)] = ["kyungki","jungja"]
df

        si     dong
0    seoul    sinsa
1    seoul  mangwon
2    busan    1dong
3    busan    2dong
4  kyungki    suwon
5  kyungki   jungja

In [29]:
# unique (using python list, using numpy ndarray)
list_df = list(set(list(groupby_df["si"]))) # Python list
print(list_df)

list_df = df["si"].unique() # numpy ndarray (bertter : fast)
print(list_df)

['seoul' 'busan' 'kyungki']

In [25]:
# groupby
print(df.groupby("si").groups)
df.groupby("si").get_group("seoul")

{'seoul': [0, 1], 'kyungki': [4, 5], 'busan': [2, 3]}

      si     dong
0  seoul    sinsa
1  seoul  mangwon

# 7. Merge

In [30]:
# make sample data (users)
users_df = pd.DataFrame(columns=["Id","Name","Age","Signup Date"])
users_df.loc[len(users_df)] = [str(len(users_df)+1), "seongyun", "27", "2016-01-01"]
users_df.loc[len(users_df)] = [str(len(users_df)+1), "seongjin", "21", "2016-04-21"]
users_df.loc[len(users_df)] = [str(len(users_df)+1), "suchan", "24", "2016-03-12"]
users_df

  Id      Name Age Signup Date
0  1  seongyun  27  2016-01-01
1  2  seongjin  21  2016-04-21
2  3    suchan  24  2016-03-12

In [31]:
# make sample data (purchase)
purchase_df = pd.DataFrame(columns=["UserId", "Amount", "Purchase Date"])
purchase_df.loc[len(purchase_df)] = ["1", "4000", "2016-01-02"]
purchase_df.loc[len(purchase_df)] = ["3", "14000", "2016-05-03"]
purchase_df.loc[len(purchase_df)] = ["2", "8000", "2016-04-29"]
purchase_df.loc[len(purchase_df)] = ["2", "42000", "2016-04-04"]
purchase_df.loc[len(purchase_df)] = ["2", "23000", "2016-03-05"]
purchase_df.loc[len(purchase_df)] = ["1", "2000", "2016-02-02"]
purchase_df.loc[len(purchase_df)] = ["3", "9000", "2016-05-25"]
purchase_df

  UserId Amount Purchase Date
0      1   4000    2016-01-02
1      3  14000    2016-05-03
2      2   8000    2016-04-29
3      2  42000    2016-04-04
4      2  23000    2016-03-05
5      1   2000    2016-02-02
6      3   9000    2016-05-25

In [32]:
# merge (different key : UserId, Id)
purchase_df.merge(users_df, left_on="UserId", right_on="Id")[["Id", "Amount", "Purchase Date", "Name", "Age", "Signup Date"]]

  Id Amount Purchase Date      Name Age Signup Date
0  1   4000    2016-01-02  seongyun  27  2016-01-01
1  1   2000    2016-02-02  seongyun  27  2016-01-01
2  3  14000    2016-05-03    suchan  24  2016-03-12
3  3   9000    2016-05-25    suchan  24  2016-03-12
4  2   8000    2016-04-29  seongjin  21  2016-04-21
5  2  42000    2016-04-04  seongjin  21  2016-04-21
6  2  23000    2016-03-05  seongjin  21  2016-04-21

In [33]:
# rename column
rename_users_df = users_df.rename(columns={"Id":"UserId"}) 

# merge (different same key : UserId)
pd.merge(purchase_df, rename_users_df)[["UserId", "Amount", "Purchase Date", "Name", "Age", "Signup Date"]]

  UserId Amount Purchase Date      Name Age Signup Date
0      1   4000    2016-01-02  seongyun  27  2016-01-01
1      1   2000    2016-02-02  seongyun  27  2016-01-01
2      3  14000    2016-05-03    suchan  24  2016-03-12
3      3   9000    2016-05-25    suchan  24  2016-03-12
4      2   8000    2016-04-29  seongjin  21  2016-04-21
5      2  42000    2016-04-04  seongjin  21  2016-04-21
6      2  23000    2016-03-05  seongjin  21  2016-04-21

# 8. File Input Output

In [34]:
# make sample data
df = pd.DataFrame([{"Name":"seongyun", "Age":27}, {"Name":"seongjin", "Age":21}, {"Name":"suchan", "Age":24}])
df

   Age      Name
0   27  seongyun
1   21  seongjin
2   24    suchan

In [35]:
# input DataFrame to csv and Save
df.to_csv("./sample.csv", index=False)

In [36]:
# Output csv to DataFrame
df = pd.read_csv("./sample.csv")
df

   Age      Name
0   27  seongyun
1   21  seongjin
2   24    suchan

In [37]:
# rename columns
df.rename(columns={"Age":"나이","Name":"이름"}, inplace=True)
df

   나이        이름
0  27  seongyun
1  21  seongjin
2  24    suchan

In [38]:
# string contains
is_contain = df["이름"].str.contains("jin")
df[is_contain]

   나이        이름
1  21  seongjin

In [40]:
# sorting
# ascending (True : 오름차순(default), False : 내림차순)
df.sort_values("나이", ascending=True).reset_index(drop=True, inplace=True)
df

   나이        이름
0  27  seongyun
1  21  seongjin
2  24    suchan